{
  "title": "Terms of Service",
  "sections": {
    "acceptance": {
      "title": "1. Acceptance of Terms",
      "content": "Welcome to \"Valorant Web Tools\" (hereinafter \"this website\", \"the service\"). By using the service you agree to these Terms of Service. If you do not agree, please cease using the service."
    },
    "serviceIntro": {
      "title": "2. Service Description",
      "content": "This website is a fan-made Valorant statistics tool that currently provides:",
      "features": [
        "Head-shot / body-shot / leg-shot rates for the signed-in player",
        "Match history lookup",
        "Win-rate ranking for the player's top three agents and maps",
        "Automatic dark / light theme based on the user's system settings",
        "Storage of the user's language preference (e.g. ZH-TW / EN) in the browser"
      ],
      "additional": "*Note*: The website does not fetch or display a player's individual daily shop, because Riot's public API does not expose that data and such usage is disallowed by Riot's policy. The service is free of charge and contains no advertisements."
    },
    "riotApi": {
      "title": "3. Riot API & Intellectual-Property Notice",
      "content": "All gameplay data is retrieved exclusively through Riot Games' official public API and in accordance with the Riot Games Developer Agreement.",
      "trademark": "League of Legends®, VALORANT™, and Riot Games® are trademarks and intellectual property of Riot Games, Inc.",
      "disclaimer": "This service is not endorsed, sponsored, or approved by Riot Games, Inc."
    },
    "userLogin": {
      "title": "4. Login & Data Scope",
      "content": "• Most features require Riot Sign-On (RSO) login to access personal game data.\n• We store only what is strictly necessary:\n  – your Riot PUUID\n  – RSO *access_token* / *entitlements_token* (AES-256 encrypted at rest)",
      "privacy": "• Tokens are retained 30 days after the last use and are automatically deleted, or you may request deletion at any time via the contact below."
    },
    "usageRules": {
      "title": "5. User Conduct",
      "content": "You agree not to:",
      "rules": [
        "a. disrupt or interfere with the service;",
        "b. attempt to reverse-engineer or overload Riot's API;",
        "c. impersonate others or request unauthorized access to another player's data;",
        "d. sell or charge for use of the service."
      ]
    },
    "liability": {
      "title": "6. Limitation of Liability",
      "content": "The service is provided *\"as is\"*. We do not warrant that all data is error-free or real-time. We shall not be liable for losses arising from data inaccuracies, downtime, or API changes by Riot Games."
    },
    "termination": {
      "title": "7. Service Changes or Termination",
      "content": "We reserve the right to add, modify, or remove features, or to terminate the service at any time without prior notice."
    },
    "jurisdiction": {
      "title": "8. Governing Law & Jurisdiction",
      "content": "These terms are governed by the laws of Taiwan (R.O.C.). Any dispute shall be submitted to the Taipei District Court as the court of first instance."
    },
    "modification": {
      "title": "9. Updates to Terms",
      "content": "We may revise these Terms; material changes will be posted on the website. Please review them periodically."
    },
    "contact": {
      "title": "10. Contact",
      "content": "Email : kennymail@jinxiang.dev"
    },
    "version": {
      "version": "Version: v1.1",
      "date": "Updated: 2025 / 07 / 06"
    }
  }
} 